import React, { Component } from 'react'
import Header from '../../components/common/Header'
import { SWITCH } from '../../config'
import './Rule.scss'

function XcRule() {
  return (
    <div>
      <Header title="X PLAN交易流程" isFixed isShadow bgWhite />
      <p>
        关于X PLAN
        <br />
        <br />
        X
        PLAN为ZBX重磅推出的计划，用户在购买XC之后可以参与到ZBX的生态建设中来，并获得相应的收益及权益。
        <br />
        <br />
        一：X PLAN快速了解
        <br />
        <br />
        1.您在购买XC之后可以提币到X PLAN系统参与X
        PLAN计划，档位分为200XC、300XC、500XC，您每投入100个XC将得到10个折扣认购额度，折扣额度认购价格为0.4USDT/XC。
        <br />
        <br />
        2.参与X PLAN计划和折扣额度时间均为为T+7,比如您在周一参与X
        PLAN，下周一将会获得已投入的XC和折扣额度认购XC的机会。
        <br />
        <br />
        二：用户邀请返佣奖励
        <br />
        <br />
        用户可以通过推广用户参与定投获得返佣奖励。平台按照推荐活跃用户数量每日进行奖励XC通证特价额度，推荐1个享受2代返佣额度，推荐2个享受3代返佣额度，推荐3个享受4代返佣折扣额度，依次类推，最高可获得7代XC通证的特价额度奖励。
        <br />
        <br />
        1代返佣：邀请用户每参与一次节点计划，推荐人将获得10个折扣认购XC额度。
        <br />
        <br />
        2代返佣：邀请用户每参与一次节点计划，推荐人将获得5个折扣认购XC额度。
        <br />
        <br />
        3代返佣：邀请用户每参与一次节点计划，推荐人将获得4个折扣认购XC额度。
        <br />
        <br />
        4代返佣：邀请用户每参与一次节点计划，推荐人将获得3个折扣认购XC额度。
        <br />
        <br />
        5代返佣：邀请用户每参与一次节点计划，推荐人将获得2个折扣认购XC额度。
        <br />
        <br />
        6代返佣：邀请用户每参与一次节点计划，推荐人将获得1个折扣认购XC额度。
        <br />
        <br />
        7代返佣：邀请用户每参与一次节点计划，推荐人将获得1个折扣认购XC额度。
        <br />
        <br />
        三：用户节点建设奖励
        <br />
        <br />
        您可以通过参与X
        PLAN节点，一起参与XC生态建设。平台将对节点进行奖励，根据节点下的有效用户数量决定每天奖励的XC通证特价折扣数量和比例。
        <br />
        <br />
        1.四级节点
        <br />
        节点下有30个有效用户，享有下属用户每10个XC折扣配额空投每参与通证定投计划一次，该节点额外获得1个XC折扣配额空投。
        <br />
        <br />
        2.三级节点
        <br />
        附属2个四级节点，且节点下有90个有效用户，享有下属用户每9个XC折扣配额空投每参与通证参与计划一次，该节点额外获得1个XC折扣
        配额空投。
        <br />
        <br />
        3.二级节点  
        <br />
        附属3个三级节点，且节点下有300个有效用户，享有下属用户每8个XC折扣配额空投每参与通证参与计划一次，该节点额外获得1个XC折扣
        配额空投。
        <br />
        <br />
        4.一级节点  
        <br />
        附属3个二级节点，且节点下有960个有效用户，享有下属用户每7个XC折扣配额空投每参与通证参与计划一次，该节点额外获得1个XC折扣
        配额空投。
        <br />
        <br />
        5.超级节点
        <br />
        附属3个一级节点，且节点下有2960个有效用户，享有下属用户每6个XC折扣配额空投每参与通证参与计划一次，该节点额外获得1个XC折扣
        配额空投.
        <br />
        <br />
        四：交易规则
        <br />
        <br />
        1.X PLAN交易时间为香港时间4:00-24:00；
        <br />
        <br />
        2.每个用户每天只能参与一次X PLAN，X PLAN和折扣额度手续费均为0.2%;
        <br />
        <br />
        3.XC一个起提，站内转账为0手续费，站外转账3个手续费。
        <br />
        <br />
        4.XC和USDT单日最高提币均为100000个，单笔最高提币均为10000个；
        <br />
        <br />
        5.用户在参与X PLAN后可享受所有平台权益，三个交易日未参与X
        PLAN将失去相关操作资格。
        <br />
        <br />
        6.折扣认购额度为2个交易日，未认购的额度将失效。
        <br />
        <br />
      </p>
    </div>
  )
}

function NttcRule() {
  return (
    <div>
      <Header title="NTTC规则说明" isFixed isShadow bgWhite />

      <p>
        一、交易规则：
        <br />
        1.NTTC参与计划时间：香港时间周一至周日，凌晨4：00点至晚上24:00点。
        <br />
        <br />
        2.NTTC参与计划的单价为2 USDT, 空投折扣价格为:0.8 USDT。
        <br />
        <br />
        3.参与计划购买档位显示3档,分别为： 200NTTC、300NTTC、500NTTC。
        <br />
        <br />
        4.每个用户每天 只能参与计划一次NTTC。
        <br />
        <br />
        5.参与计划的NTTC 收取NTTC手续费 0.2%
        <br />
        <br />
        6.认购空投折扣价NTTC收取 USDT 手续费 0.2%
        <br />
        <br />
        7.参与计划时间为 t+7 空投折扣认购冻结也为 t+7, 也就是周一任何时间买,
        下周一一开市就会得到参与计划与冻结NTTC。
        <br />
        <br />
        二、账户规则：
        <br />
        <br />
        1.NTTC 1个起提, 站内转账0个手续费,站外3个手续费
        <br />
        <br />
        2.USDT 0.1起提, 站内0个手续费,站外5个手续费
        <br />
        <br />
        3.NTTC每人每日最高提币100000，单笔最高提币10000
        <br />
        <br />
        4.USDT每人每日最高提币100000，单笔最高提币10000
        <br />
        <br />
        5.用户在参与计划的NTTC到平台以后可享受所有平台权益，三个交易日内未进行参与计划的NTTC操作将失去权益资格。
        <br />
        <br />
        6.空投折扣价认购额度的有效期为2个交易日,未认购的额度将失效。
        <br />
        <br />
        三、奖励规则：
        <br />
        <br />
        用户参与计划奖励：用户每参与计划100个NTTC将得到10个NTTC空投折扣认购额度。
        <br />
        <br />
        四、用户邀请返佣奖励:
        <br />
        <br />
        用户可以通过邀请用户参与通证参与计划计划获得返佣奖励，平台按照推荐有效用户数量进行奖励NTTC折扣空投配额。
        <br />
        <br />
        1、代数奖
        <br />
        1代奖励，被推广用户每参与一次节点计划，推荐人将获得5个空投折扣的NTTC。
        2代奖励，被推广用户每参与一次节点计划，推荐人将获得3个空投折扣的NTTC。
        <br />
        <br />
        2、管理奖 <br />
        管理奖=（下级代数奖+下级管理奖）*50%
        <br />
        <br />
        五、用户节点建设奖励
        <br />
        <br />
        用户可以通过建立参与计划节点，为NTTC生态建设做贡献。平台将对节点进行奖励，根据节点下邀请的有效用户的数量决定每天奖励NTTC通证特价额度
        的数量和比例。
        <br />
        <br />
        1、四级节点
        <br />
        节点下有30个有效用户，享有整个节点范围内所有股东当日空投配额的1/10，作为额外的节点奖励，每日结算发放一次。
        <br />
        <br />
        2、三级节点
        <br />
        附属2个四级节点，
        且节点下有90个有效用户，享有整个节点范围内所有股东当日空投配额的1/9，作为额外的节点奖励，每日结算发放一次。
        <br />
        <br />
        3、二级节点
        <br />
        附属3个三级节点，
        且节点下有300个有效用户，享有整个节点范围内所有股东当日空投配额的1/8，作为额外的节点奖励，每日结算发放一次。
        <br />
        <br />
        4、一级节点
        <br />
        附属3个二级节点，
        且节点下有960个有效用户，享有整个节点范围内所有股东当日空投配额的1/7，作为额外的节点奖励，每日结算发放一次。
        <br />
        <br />
        5、超级节点
        <br />
        附属3个一级节点，
        且节点下有2960个有效用户，享有整个节点范围内所有股东当日空投配额的1/6，作为额外的节点奖励，每日结算发放一次。
      </p>
    </div>
  )
}

class Rule extends Component {
  render() {
    const isXC = SWITCH.PROJECT === 'XC'
    return <div id="rule">{isXC ? <XcRule /> : <NttcRule />}</div>
  }
}

export default Rule
